; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	thermograph0 - mode
	infrared2 - mode
	infrared1 - mode
	GroundStation1 - direction
	Star3 - direction
	Star5 - direction
	Star0 - direction
	GroundStation2 - direction
	Star4 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 infrared1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star5)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument3 thermograph0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared2)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet9)
	(supports instrument5 infrared2)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star14)
	(supports instrument6 infrared2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation2)
)
(:goal (and
	(pointing satellite1 Planet7)
	(pointing satellite2 GroundStation1)
	(pointing satellite4 Star8)
	(have_image Phenomenon6 thermograph0)
	(have_image Planet7 infrared1)
	(have_image Star8 infrared1)
	(have_image Planet9 thermograph0)
	(have_image Star10 infrared1)
	(have_image Planet11 infrared2)
	(have_image Planet12 infrared2)
	(have_image Star13 infrared2)
	(have_image Star14 infrared2)
	(have_image Star15 infrared2)
	(have_image Star16 infrared1)
))

)

; plan
1. (turn_to satellite2 star0 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star0)
   goals met: 1 of 14
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 14
3. (calibrate satellite2 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 1 of 14
4. (turn_to satellite2 star10 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star10)
   goals met: 1 of 14
5. (take_image satellite2 star10 instrument4 infrared1)
   added: (have_image star10 infrared1)
   goals met: 2 of 14
6. (turn_to satellite2 planet9 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 planet9)
   goals met: 2 of 14
7. (take_image satellite2 planet9 instrument4 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 3 of 14
8. (turn_to satellite2 planet7 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet7)
   goals met: 3 of 14
9. (take_image satellite2 planet7 instrument4 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 4 of 14
10. (turn_to satellite2 planet12 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet12)
   goals met: 4 of 14
11. (take_image satellite2 planet12 instrument4 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 5 of 14
12. (turn_to satellite2 planet11 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 planet11)
   goals met: 5 of 14
13. (take_image satellite2 planet11 instrument4 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 6 of 14
14. (turn_to satellite2 phenomenon6 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon6)
   goals met: 6 of 14
15. (take_image satellite2 phenomenon6 instrument4 thermograph0)
   added: (have_image phenomenon6 thermograph0)
   goals met: 7 of 14
16. (turn_to satellite2 star13 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star13)
   goals met: 7 of 14
17. (take_image satellite2 star13 instrument4 infrared2)
   added: (have_image star13 infrared2)
   goals met: 8 of 14
18. (turn_to satellite2 star14 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star14)
   goals met: 8 of 14
19. (take_image satellite2 star14 instrument4 infrared2)
   added: (have_image star14 infrared2)
   goals met: 9 of 14
20. (turn_to satellite2 star15 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star15)
   goals met: 9 of 14
21. (take_image satellite2 star15 instrument4 infrared2)
   added: (have_image star15 infrared2)
   goals met: 10 of 14
22. (turn_to satellite2 star16 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star16)
   goals met: 10 of 14
23. (take_image satellite2 star16 instrument4 infrared1)
   added: (have_image star16 infrared1)
   goals met: 11 of 14
24. (turn_to satellite2 star8 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star8)
   goals met: 11 of 14
25. (take_image satellite2 star8 instrument4 infrared1)
   added: (have_image star8 infrared1)
   goals met: 12 of 14
26. (turn_to satellite2 groundstation1 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 groundstation1)
   goals met: 13 of 14
27. (turn_to satellite4 star8 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 star8)
   goals met: 14 of 14
